000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КачествоОбслуживанияПродаж/КачествоОбслуживанияПродаж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КачествоОбслуживанияПродаж</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Оценка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </resources>
  <resources>
    <name>МобильноеУстройство</name>
    <type>
      <types>CatalogRef.СтруктураУзлов</types>
    </type>
  </resources>
  <resources>
    <name>ДисконтнаяКарта</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </resources>
  <resources>
    <name>ВладелецДисконтнойКарты</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаОценки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Продавец</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ЧекККМ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КачествоОбслуживанияПродаж/ManagerModule.bsl
//	LNK 19.02.2019 15:01:27
Процедура РегламентнаяОчистка()	Экспорт

	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КачествоОбслуживанияПродаж.Период КАК Период,
	|	КачествоОбслуживанияПродаж.ДокументПродажи КАК ДокументПродажи,
	|	КачествоОбслуживанияПродаж.Магазин КАК Магазин
	|ИЗ
	|	РегистрСведений.КачествоОбслуживанияПродаж КАК КачествоОбслуживанияПродаж
	|ГДЕ
	|	КачествоОбслуживанияПродаж.Период < НАЧАЛОПЕРИОДА(&ТекущаяДата, ДЕНЬ)
	|	И КачествоОбслуживанияПродаж.ДатаОценки = ДАТАВРЕМЯ(1, 1, 1)
	|	И КачествоОбслуживанияПродаж.Оценка = 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	ДокументПродажи"
	);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());

	КачествоВыборка = Запрос.Выполнить().Выбрать();

	НаборЗаписей = РегистрыСведений.КачествоОбслуживанияПродаж.СоздатьНаборЗаписей();
	НаборЗаписей.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
	НаборЗаписей.ДополнительныеСвойства.Вставить("ПропуститьПроверкуЗапретаИзменения"  , Истина);
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.ОбменДанными.Получатели.АвтоЗаполнение = Ложь;

	Счетчик = 0;

	Пока КачествоВыборка.Следующий() Цикл

		НаборЗаписей.ОбменДанными.Получатели.Очистить();
		ОбменДаннымиСервер.УстановитьПолучателейМагазина(НаборЗаписей.ОбменДанными.Получатели, КачествоВыборка.Магазин);

		НаборЗаписей.Отбор.ДокументПродажи.Установить(КачествоВыборка.ДокументПродажи);
		НаборЗаписей.Записать();

		Счетчик = Счетчик + 1;

	КонецЦикла;

КонецПроцедуры
